/*
    -- DQL 语言（Data QueryLanguage，数据查询语言）

        -- 基础查询

        -- 条件查询

        -- 排序查询

        -- 常见函数

        -- 分组函数

        -- 连接查询

        -- 子查询

        -- 分页查询

        -- union 联合查询


    -- 基础查询

        -- 语法

            -- select 查询列表 from 表名;

            -- 类似于 System.out.println(打印的东西)

            -- 特点

                --  查询列表可以是 表中的字段、常量值、表达式、函数

                --  查询的结果是一个虚拟的表格


    --  查询时注意的细节

        -- 查询之前打开对应的数据库

            -- USE myemployees;

        -- 字段用着重号（反引号） `` 标识，不用的话会默认添加，但是一些字段名和关键字容易混淆的字段必须加。其他字符不能用着重号，可以用双引号或单引号
*/